html/intepreter/continuation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>续延</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="content">
<h1 class="title">续延</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb31f442">定义</a></li>
<li><a href="#orga2477ec">call/cc</a></li>
<li><a href="#org7b9b839">CPS</a>
<ul>
<li><a href="#orgf1478c0">递归CPS</a></li>
<li><a href="#orgb5bd440">续延和CPS</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>续延</b> 是在 <b>运行中被暂停了的程序</b> ：即含有 <b>计算状态</b> 的 <b>单个函数型对象</b> 。当这个对象被求值时，就会在它上次停下来的地方重新启动之前保存下来的计算
</p>

<p>
对于求解特定类型的问题，能够保存程序的状态并在之后重启是非常有用的：
</p>
<ul class="org-ul">
<li>在多进程中，续延可以很方便地表示挂起的进程</li>
<li>在非确定性的搜索问题里，续延可以用来表示搜索树中的节点</li>
</ul>

<div id="outline-container-orgb31f442" class="outline-2">
<h2 id="orgb31f442">定义</h2>
<div class="outline-text-2" id="text-orgb31f442">
<p>
<b>续延</b> 是一个代表着 <span class="underline">计算的将来</span> 的函数。不管是哪一个表达式被求值，总会有谁在翘首以待它将要返回的值：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>/ <span style="color: #696969;">(</span>- x 1<span style="color: #696969;">)</span> 2<span style="color: #696969;">)</span>
</pre>
</div>
<p>
例如，当求值  <span class="underline">(- x 1)</span> 时，外面的 <span class="underline">/</span> 表达式就在等着这个值，依此类推下去，最后总是回到toplevel上 <span class="underline">print</span> 正等在那里
</p>

<p>
无论何时，都可以把续延视为 <b>带一个参数的函数</b> 。上面的表达式被输入到 toplevel，那么当子表达式 <span class="underline">(- x 1)</span> 被求值时，续延将是：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>val<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>/ val 2<span style="color: #696969;">))</span>
</pre>
</div>

<p>
也就是说，接下来的计算可以通过在返回值上调用这个函数来重现。如果该表达式在下面的上下文中出现：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">f1</span> w<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>y <span style="color: #696969;">(</span>f2 w<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>integer? y<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>list 'a y<span style="color: #696969;">)</span> 'b<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">f2</span> x<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>/ <span style="color: #696969;">(</span>- x 1<span style="color: #696969;">)</span> 2<span style="color: #696969;">))</span>
</pre>
</div>

<p>
并且 <span class="underline">f1</span> 在toplevel 下被调用，那么当 <span class="underline">(- x 1)</span> 被求值时，续延将等价于：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>val<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>y <span style="color: #696969;">(</span>/ val 2<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>integer? y<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>list 'a y<span style="color: #696969;">)</span> 'b<span style="color: #696969;">)))</span>
</pre>
</div>

<p>
续延可以理解成是一种广义的闭包：
</p>
<ul class="org-ul">
<li>闭包：一个 <span class="underline">函数</span> 加上一些指向 <span class="underline">闭包创建时可见的词法变量的指针</span></li>
<li>续延：一个 <span class="underline">函数</span> 加上一个指向其 <span class="underline">创建时所在的整个栈的指针</span></li>
</ul>

<pre class="example">
    当续延被求值时，它返回的是使用自己的栈拷贝算出的结果，而没有用当前栈

    如果某个续延是在 T1 时刻创建的，而在 T2 时刻被求值，那么它求值时使用的将是 T1 时刻的栈
</pre>
</div>
</div>

<div id="outline-container-orga2477ec" class="outline-2">
<h2 id="orga2477ec">call/cc</h2>
<div class="outline-text-2" id="text-orga2477ec">
<p>
在 Scheme 中，续延和函数同样是第一类对象。可以要求 Scheme 返回当前的续延，然后它将为你 <b>生成一个只有单个参数的函数</b> ，以表示 <b>未来的计算</b> 。可以任意长时间地保存这个对象，然后在你调用它时，它将重启当它被创建时所发生的计算
</p>

<p>
Scheme 程序通过内置操作符 <span class="underline">call-with-current-continuation</span> (缩写为 <span class="underline">call/cc</span> ) 来 <b>访问当前续延</b> 。当一个程序在一个单个参数的函数上调用 call/cc 时：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">call-with-current-continuation</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>cc<span style="color: #696969;">)</span>
    ...<span style="color: #696969;">))</span> 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">frozen</span> '<span style="color: #696969;">())</span>

<span style="color: #696969;">(</span>append '<span style="color: #696969;">(</span>the call/cc returned<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>list <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">call-with-current-continuation</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>cc<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>set! frozen cc<span style="color: #696969;">)</span>
        'a<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
虽然这个 call/cc 返回了 a ，实际上会把 <b>当前续延</b> 通过参数 <span class="underline">cc</span> 传入，然后保存在了全局变量 <span class="underline">frozen</span> 中，当前续延等价于：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>val<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>append '<span style="color: #696969;">(</span>the call/cc returned<span style="color: #696969;">)</span>
          <span style="color: #696969;">(</span>list val<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span>set! frozen <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>val<span style="color: #696969;">)</span>
               <span style="color: #696969;">(</span>append '<span style="color: #696969;">(</span>the call/cc returned<span style="color: #696969;">)</span>
                       <span style="color: #696969;">(</span>list val<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
以后每次调用 <span class="underline">frozen</span> 都可以认为是执行上面这段续延保存的过程：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>frozen 'again<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt;  (the call/cc returned again) </span>

<span style="color: #696969;">(</span>append '<span style="color: #696969;">(</span>the call/cc returned<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>list 'again<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt;  (the call/cc returned again) </span>
</pre>
</div>

<p>
续延不会因为被求值而用完。它们可以被 <b>重复</b> 调用，就像任何其他的函数型对象一样：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>frozen 'thrice<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt;  (the call/cc returned thrice) </span>

<span style="color: #696969;">(</span>append '<span style="color: #696969;">(</span>the call/cc returned<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>list 'thrice<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt;  (the call/cc returned thrice) </span>
</pre>
</div>

<p>
当在某些其他的计算里调用一个续延时，可以更清楚地看到所谓返回到原先的栈上是什么意思：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>+ 1 <span style="color: #696969;">(</span>frozen 'safely<span style="color: #696969;">))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (the call/cc returned safely)</span>
</pre>
</div>

<p>
注意：紧接着的 <span class="underline">+</span> 当 <span class="underline">frozen</span> 调用时被忽略掉了。后者返回到了它首次被创建时的栈上：先经过 list ，然后是 append ，直到 toplevel。如果 frozen 像正常函数调用那样返回了一个值，那么上面的表达式将在试图给一个列表加 1 时产生一个错误
</p>

<p>
各续延并不会每人都分到自己的一份栈的拷贝。它们可能跟其他续延或者当前正在进行的计算 <b>共享一些变量</b> 。两个续延共享了同一个栈：
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">froz1</span> '<span style="color: #696969;">())</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">froz2</span> '<span style="color: #696969;">())</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>x 0<span style="color: #696969;">))</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">call-with-current-continuation</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>cc<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>set! froz1 cc<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>set! froz2 cc<span style="color: #696969;">)))</span>
  <span style="color: #696969;">(</span>set! x <span style="color: #696969;">(</span>+ 1 x<span style="color: #696969;">))</span>
  x<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 1</span>
</pre>
</div>

<p>
因此调用任何一个都将返回后继的整数：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>froz1 '<span style="color: #696969;">())</span> <span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">=&gt; 2</span>

<span style="color: #696969;">(</span>froz2 '<span style="color: #696969;">())</span> <span style="color: #5f9ea0; font-style: italic;">;</span><span style="color: #5f9ea0; font-style: italic;">=&gt; 3</span>
</pre>
</div>

<p>
由于 call/cc 表达式的值将被丢弃，所以无论给 <span class="underline">froz1</span> 和 <span class="underline">froz2</span> 什么参数都无关紧要
</p>
</div>
</div>
