src/scheme/continuation.org
* CPS 
  *CPS* ( _continuation-programming-style_ ) 是一种编程方式： *附加的最后一个参数是一个函数，把原来的计算结果传入这个函数作为返回值* 

  #+BEGIN_SRC scheme
  (define (return x)
    x)

  (define (k+ a b k)
    (k (+ a b)))

  (define (k* a b k)
    (k (* a b))) 
  #+END_SRC 

  使用CPS风格来计算 _(* (+ 1 2) 3)_ 
  #+BEGIN_SRC scheme
  (k+ 1 2
      (lambda (x)
	(k* x 3 return))) ; => 9
  #+END_SRC

  一般情况下，括号内的结算结果作为返回值，对于CPS而言括号内计算结果被传入下一个参数， 比如 _(+ 1 2)_ 被传入了 _(k * x 3 return)_ ，而 (* 3 3) 的结果被传入 _return_ 

