html/intepreter/continuation.html

<div id="outline-container-org7b9b839" class="outline-2">
<h2 id="org7b9b839">CPS</h2>
<div class="outline-text-2" id="text-org7b9b839">
<p>
<b>CPS</b> ( <span class="underline">continuation-programming-style</span> ) 是一种编程方式： <b>附加的最后一个参数是一个函数，把原来的计算结果传入这个函数作为返回值</b> 
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">return</span> x<span style="color: #696969;">)</span>
  x<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">k+</span> a b k<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>k <span style="color: #696969;">(</span>+ a b<span style="color: #696969;">)))</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">k*</span> a b k<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>k <span style="color: #696969;">(</span>* a b<span style="color: #696969;">)))</span> 
</pre>
</div>

<p>
使用CPS风格来计算 <span class="underline">(* (+ 1 2) 3)</span> 
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>k+ 1 2
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x<span style="color: #696969;">)</span>
      <span style="color: #696969;">(</span>k* x 3 return<span style="color: #696969;">)))</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; 9</span>
</pre>
</div>

<p>
一般情况下，括号内的结算结果作为返回值，对于CPS而言括号内计算结果被传入下一个参数， 比如 <span class="underline">(+ 1 2)</span> 被传入了 <span class="underline">(k * x 3 return)</span> ，而 (* 3 3) 的结果被传入 <span class="underline">return</span> 
</p>
</div>
